
{
  "title":"Project Description",
  "content":"All images courtesy of Alex Slocum.\nTic tech toe.\nTable Description The 2005 table was inspired by the new undergraduate dormitory at MIT, Simmons Hall.\nThere are three major elements to the table:\nThe Starting Zones - Each robot must begin the competition within this 18 inch by 18 inch square. The starting zone extends to 26 inches above the table surface. Robots can be located anywhere within this volume. However, they still must fit into the sizing box when in the starting zone. The starting zone is demarcated by a one to two inch line around the starting zone. Foam Blocks - Sixteen blocks will be placed on the table as shown in the solid model. Half of the blocks will be colored for each team and placed on the corresponding side of the table. Each block will have a single side which is marked. The blocks are made of lightweight foam and are approximately cubic with dimensions of 8\u0026quot;x8\u0026quot;x8\u0026quot;. Foam blocks.\nSimmons Hall - The hall structure is made up of horizontal and vertical bins stacked as shown in the figure. The bottom row of horizontal bins are open on the front and back sides. The top three rows of horizontal bins are open only in the front. The two long vertical bins on the sides of the structure are open only on the top. Each horizontal bin can hold only one block at a time, while the vertical bin can hold three blocks at a time. Detailed dimensions available in the drawings (PDF). Simmons hall.\nHow the Contest Will Run During the contest, eight control boxes will be in constant use with two spares in case of a failure. Each table will have four control boxes, two of each color associated with that table\u0026rsquo;s starting zones. Each color will have a different control frequency assigned to it, so two control boxes will have the same frequency. The first table will have blue and red starting zones, control boxes, and podiums. The second table will have green and yellow of the same items.\nTable One Table TWO Blue \u0026ldquo;A\u0026rdquo;\nBlue \u0026ldquo;B\u0026rdquo;\nX1 Mhz.\nRed \u0026ldquo;A\u0026rdquo;\nRed \u0026ldquo;B\u0026rdquo;\nX2 Mhz.\nGreen \u0026ldquo;A\u0026rdquo;\nGreen \u0026ldquo;B\u0026rdquo;\nX3 Mhz.\nYellow \u0026ldquo;A\u0026rdquo;\nYellow B\u0026quot;\nX4 Mhz.\nTo keep the contest going at a good clip, control boxes will be installed in the pit area. To prevent machines from running wild in the pit area, the boxes installed there (the \u0026ldquo;B\u0026rdquo; set for example), will be left off while the \u0026ldquo;A\u0026rdquo; set is in operation on the table. Only when machines are placed on the table and about to start will their control boxes be turned on. After a contest, control boxes will be immediately shut off and returned to the pit area to repeat the cycle.\nFor obvious reasons, it is vital that control boxes in the on-deck area remain off!\nAlso, please be sure to return your control box to the pit area to ensure that Maureen doesn\u0026rsquo;t have to track you down!\nThe Contest Day Layout Contest day layout.\nOn contest day, the Johnson Center will be arranged as shown in the above figure. Students should follow this procedure during the contest:\nWaiting - Students should sit in the student section, or you may check on or fix your machine. Your machines will be stored in the back right side of the ice rink (no ice anymore). There will be a repair table present with basic tools, some extra fasteners and wire, etc for limited repairs to your machine. Only major owies approved by Prof. Slocum may be brought back to the lab for repairs. You should also have your batteries charged or in the charger at this point. On Call - When you are told to get ready on call, you should bring your machine with the battery over to the On-Deck table specified on the bracket display. Do not bring your FREM box, drill, or other tools. You should follow the outlined arrows to go from the storage area to the On-Deck table. Do not wander around the AV Zone or the AV guys will eat you. On-Deck - When you are called to On-Deck status, you should notify the judge at the table of your name so they can double check you are in the right spot. You will then connect your battery to the control box using the AMP 4-pin connecter. You and the judge should verify that the power to the box is off so your machine doesn\u0026rsquo;t go berserk during the contest. Then connect the AMP 14-pin motor plug to the control box. Secure the control box to your machine, making sure the judge can reach the power buttons and connectors. You will then wait patiently until the current contest is over. On the Table - When you move to the competition table, you have 30 seconds to place your machine on the table as you see fit and turn on the power. The judge will then verify that power is on and that you meet all the required space rules. You will then move to the control podium. You may have one additional driver. You may not use the power tether cable during the contest. Competing - Prof. Slocum will countdown to start each contest. All contestants must keep their hands off the control podium until he says GO. At all times during the competition, you must remain on the black static mat behind each podium for both safety and control system reasons. The round will run the designated time, at which point the table scoring system will freeze the final scores and announce the winners. The round does not end until the buzzer on the scoring system sounds. Prof. Slocum may begin a countdown early or get excited, so pay attention to the scoring system. Although the control system will still be operational after the buzzer sounds, no additional score will be tallied. If there is an issue with scoring mass due to machines in the bins, blockers, etc, the judges will remove the offending mass and rescore the round manually as required. At any time during the round, the judges may disqualify either contestants or declare double wins and losses as they determine within the contest rules. After Competition - After your competition has ended, you should quickly remove your machine from the table. You may use the control to remove triggers, rewind things, etc, but you must do so quickly. The UAs and next contestants will be eager to reset the table and get ready for the next round. After you have removed your machine from the table, immediately shut off the control box. Then disconnect the motor plug and power plug. Be sure to return the control box to the judges or UAs at your On-Deck table. Prof. Slocum will make you do push-ups if you don\u0026rsquo;t bring it back! Then bring your machine back to the storage area. If you are competing again that night, you may want to recharge your battery or make repairs as needed. "}


